DELETE FROM users;
DELETE FROM roles;
DELETE FROM restaurants;
DELETE FROM dishes;
DELETE FROM user_votes;
DELETE FROM menu_lists;

ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users(name,email,password) VALUES
  ('Алексей Иванов','ivanov.alexey@gmail.com','111'),
  ('Андрей Горбунов','andrunov@gmail.com','222'),
  ('Павел Сидоров','sidor@gmail.com','333'),
  ('Roberto Zanetti','rzanetti@gmail.com','444'),
  ('John Bon Jovi','jbj@gmail.com','555'),
  ('Didier Maoruani','dmauruani@gmail.com','666');

INSERT INTO roles(user_id, role) VALUES
  (100000,'ROLE_USER'),
  (100001,'ROLE_USER'),
  (100001,'ROLE_ADMIN'),
  (100002,'ROLE_USER'),
  (100003,'ROLE_USER'),
  (100004,'ROLE_USER'),
  (100005,'ROLE_USER');

INSERT INTO restaurants(name, address) VALUES
  ('Ёлки-палки','ул. Некрасова, 14'),
  ('Пиццерия','пл. Пушкина, 6'),
  ('Закусочная','Привокзальная пл, 3'),
  ('Прага','ул. Арбат, 1');

INSERT INTO menu_lists(restaurant_id, description, date_time) VALUES
  (100006,'Меню на 14.01','2017-01-14 16:30:00'),
  (100007,'Обед комплексный','2017-01-14 15:45:00'),
  (100008,'Обед','2017-01-14 15:40:00'),
  (100009,'Обед','2017-01-14 15:32:00');

INSERT INTO orders(user_id, restaurant_id, menu_list_id,date_time, status ) VALUES
  (100000,100006,100010,'2017-01-15 15:47:00','ACCEPTED'),
  (100001,100006,100010,'2017-01-14 18:49:00','ACCEPTED'),
  (100002,100007,100011,'2017-01-15 12:07:00','ACCEPTED'),
  (100003,100007,100011,'2017-01-15 02:09:00','ACCEPTED'),
  (100004,100008,100012,'2017-01-15 14:17:00','ACCEPTED'),
  (100005,100009,100013,'2017-01-15 09:29:00','ACCEPTED');

INSERT INTO dishes( menu_list_id,description,price) VALUES
  (100010,'Каша овсяная',1.25),
  (100010,'Сырники',3.45),
  (100010,'Блины',2.48),
  (100010,'Суп гороховый',5.57),
  (100010,'Рассольник',6.87),
  (100011,'Жульен с грибами',12.47),
  (100011,'Пельмени',7.96),
  (100011,'Котлета по киевски',14.58),
  (100011,'Чай черный',0.55),
  (100012,'Чай зеленый',0.55),
  (100012,'Кофе черный',0.75),
  (100012,'Кофе белый',0.95),
  (100012,'Котлета по питерски',12.54),
  (100012,'Поросенок под хреном',24.58),
  (100013,'Чебурек',4.62),
  (100013,'Беляш',4.12),
  (100013,'Чай черный с лимоном',1.95),
  (100013,'Борщ',17.58),
  (100013,'Плов узбекский',12.75),
  (100013,'Салат оливье',8.12);

INSERT INTO orders_dishes(order_id, dish_id,dish_quantity) VALUES
  (100014,100020,1),
  (100014,100021,2),
  (100014,100023,1),
  (100015,100020,1),
  (100015,100021,1),
  (100015,100023,2),
  (100015,100024,1),
  (100016,100025,1),
  (100016,100026,2),
  (100016,100027,1),
  (100017,100027,1),
  (100017,100028,2),
  (100018,100029,1),
  (100018,100030,2),
  (100019,100034,1),
  (100019,100035,1),
  (100019,100036,1),
  (100019,100037,2),
  (100019,100038,3),
  (100019,100039,1);

INSERT INTO orders(user_id, restaurant_id, menu_list_id,date_time, status) VALUES
  (100005,100009,100013,'2017-02-15 16:32:00','READY'),
  (100005,100009,100013,'2017-02-15 18:28:00','FINISHED');

INSERT INTO orders_dishes(order_id, dish_id,dish_quantity) VALUES
  (100040,100034,1),
  (100040,100035,1),
  (100040,100036,1),
  (100040,100037,2),
  (100040,100038,3),
  (100040,100039,1),

  (100041,100034,1),
  (100041,100035,1),
  (100041,100036,1),
  (100041,100037,2),
  (100041,100038,3),
  (100041,100039,1);