DELETE FROM users;
DELETE FROM roles;
DELETE FROM restaurants;
DELETE FROM menu_items;
DELETE FROM dishes;
DELETE FROM menu_lists;
ALTER SEQUENCE GLOBAL_SEQ RESTART WITH 100000;

INSERT INTO users(name,email,password) VALUES
  ('Алексей Иванов','ivanov.alexey@gmail.com','111222'),
  ('Андрей Горбунов','andrunov@gmail.com','222333'),
  ('Павел Сидоров','sidor@gmail.com','333444'),
  ('Roberto Zanetti','rzanetti@gmail.com','444555'),
  ('John Bon Jovi','jbj@gmail.com','555666'),
  ('Didier Maoruani','dmauruani@gmail.com','666777');

INSERT INTO roles(user_id, role) VALUES
  (100000,'ROLE_USER'),
  (100001,'ROLE_ADMIN'),
  (100002,'ROLE_USER'),
  (100003,'ROLE_USER'),
  (100004,'ROLE_USER'),
  (100005,'ROLE_USER');

INSERT INTO restaurants(name, address) VALUES
  ('Ёлки-палки','ул. Некрасова, 14'),
  ('Пиццерия','пл. Пушкина, 6'),
  ('Закусочная','Привокзальная пл, 3'),
  ('Прага','ул. Арбат, 1');


INSERT INTO menu_lists( date, restaurant_id) VALUES
  (curdate(), 100006),
  (curdate(), 100007),
  (curdate(), 100008),
  (curdate(), 100009),
  ('2022-12-14 00:00:00', 100006),
  ('2022-12-14 00:00:00', 100007),
  ('2022-12-14 00:00:00', 100008),
  ('2022-12-14 00:00:00', 100009),
  ('2022-12-15 00:00:00', 100006),
  ('2022-12-15 00:00:00', 100007),
  ('2022-12-15 00:00:00', 100008),
  ('2022-12-15 00:00:00', 100009);

INSERT INTO dishes(name) VALUES
  ('Каша овсяная'),
  ('Сырники'),
  ('Блины'),
  ('Суп гороховый'),
  ('Рассольник'),
  ('Жульен с грибами'),
  ('Пельмени'),
  ('Котлета по киевски'),
  ('Чай черный'),
  ('Чай зеленый'),
  ('Кофе черный'),
  ('Кофе белый'),
  ('Котлета по питерски'),
  ('Поросенок под хреном'),
  ('Манты грузинские'),
  ('Жаркое'),
  ('Чай черный с лимоном'),
  ('Борщ'),
  ('Плов узбекский'),
  ('Салат оливье');


INSERT INTO menu_items(menu_list_id, dish_id,price) VALUES
  (100010,100022,1.25),
  (100010,100023,3.45),
  (100010,100024,2.48),
  (100010,100025,5.57),
  (100010,100026,6.87),
  (100011,100027,12.47),
  (100011,100028,7.96),
  (100011,100029,14.58),
  (100011,100030,0.55),
  (100011,100031,0.55),
  (100012,100032,0.75),
  (100012,100033,0.95),
  (100012,100034,12.54),
  (100012,100035,24.58),
  (100012,100036,4.62),
  (100013,100037,4.12),
  (100013,100038,1.95),
  (100013,100039,17.58),
  (100013,100040,12.75),
  (100013,100041,8.12),

  (100016,100028,7.96),
  (100016,100029,14.58),
  (100016,100030,0.55),
  (100016,100031,0.55),
  (100016,100032,0.75),
  (100016,100033,0.95),
  (100016,100034,12.54),

  (100018,100034,12.54),
  (100018,100035,24.58),
  (100018,100036,4.62),
  (100018,100037,4.12),
  (100018,100038,1.95),
  (100018,100039,17.58);

INSERT INTO votes(date_time, user_id, restaurant_id, MENU_LIST_ID) VALUES
                                                                       ('2022-12-14 11:35:00' , 100000, 100006, 100014),
                                                                       ('2022-12-15 10:15:00' , 100000, 100009, 100021),
                                                                       (now() , 100000, 100006, 100010),

                                                                       ('2022-12-14 10:25:00' , 100001, 100006, 100014),
                                                                       ('2022-12-15 10:17:00' , 100001, 100006, 100018),
                                                                       (now() , 100001, 100007, 100011),

                                                                       ('2022-12-14 10:55:00', 100002, 100008, 100016),
                                                                       ('2022-12-15 10:15:00', 100002, 100006, 100018),
                                                                       (now(), 100002, 100007, 100011),

                                                                       ('2022-12-14 10:35:00', 100003, 100008, 100016),
                                                                       ('2022-12-15 9:15:00', 100003, 100007, 100019),
                                                                       (now(), 100003, 100007, 100019),

                                                                       ('2022-12-14 8:35:00', 100004, 100007, 100015),
                                                                       ('2022-12-15 10:45:00', 100004, 100008, 100020),
                                                                       (now(), 100004, 100008, 100012),

                                                                       ('2022-12-14 10:35:00', 100005, 100006, 100014),
                                                                       ('2022-12-15 11:35:00', 100005, 100009, 100021),
                                                                       (now(), 100005, 100009, 100013);